---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportUtils Methods
ExportUtils Class See Also Send Feedback
---

The ExportUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetExportId(Subelement) | Retrieves the GUID representing the subelement in DWF and IFC export. |
|  | GetExportId(Document, ElementId) | Retrieves the GUID representing this element in DWF and IFC export. |
|  | GetGBXMLDocumentId | Retrieves the GUID representing this document in exported gbXML files. |
|  | GetNurbsSurfaceDataForSurface | Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface]. |

# See Also

ExportUtils Class

Autodesk.Revit.DB Namespace